webhook_receiver/app/controllers/hooks_controller.rb

INSERT INTO "task_statuses" ("created_at", "title", "updated_at", "task_list", "description", "status") VALUES('2010-09-14 16:11:28', 'arrays', '2010-09-14 16:11:28', 'ruby', '', 'completed')
INSERT INTO "tasks" ("created_at", "title", "updated_at", "task_list", "description", "status") VALUES('2010-09-14 16:05:31', 'arrays', '2010-09-14 16:05:31', 'ruby', '', 'completed')
---
  def task
    TaskStatus.create(:task_list => params[:task_list], :title => params[:task_title], :description => params[:task_description],
                  :status => params[:status] )