webhook_receiver/app/controllers/task_statuses_controller.rb

SELECT * FROM "task_statuses"
---
  def index
    @task_statuses = TaskStatus.all