app/controllers/tasks_controller.rb

SELECT * FROM `tasks` WHERE (`tasks`.task_list_id = 1)
---
  def index
    @tasks = Task.all

SELECT * FROM `tasks` WHERE (`tasks`.`id` = 2)
---
  def show
    @task = Task.find(params[:id])

SELECT * FROM `task_lists` WHERE (`task_lists`.`id` = 1)
---
  def new
    @task = Task.new
    @task_list = TaskList.find_by_id(params[:task_list_id])

SELECT * FROM `tasks` WHERE (`tasks`.`id` = 2)
---
  def edit
    @task = Task.find(params[:id])

SELECT * FROM `task_lists` WHERE (`task_lists`.`id` = 1)
INSERT INTO `tasks` (`created_at`, `title`, `updated_at`, `task_list_id`, `due_date`, `description`, `status`) VALUES('2010-09-12 10:00:54', 'export', '2010-09-12 10:00:54', 1, '2010-09-12', 'exported', 0)
---
  def create
    @task = Task.new(params[:task])
    @task_list = TaskList.find_by_id(params[:task][:task_list_id])
    respond_to do |format|
      if @task.save

SELECT * FROM `tasks` WHERE (`tasks`.`id` = 2)
SELECT * FROM `task_lists` WHERE (`task_lists`.`id` = 1)
UPDATE `tasks` SET `updated_at` = '2010-09-12 10:26:02', `status` = 1, `description` = 'exported one two' WHERE `id` = 2
---
  def update
    @task = Task.find(params[:id])
    @task_list = TaskList.find_by_id(params[:task][:task_list_id])
    respond_to do |format|
      if @task.update_attributes(params[:task])

SELECT * FROM `tasks` WHERE (`tasks`.`id` = 1)
DELETE FROM `tasks` WHERE `id` = 1
---
  def destroy
    @url = request.env["HTTP_REFERER"]
    @task = Task.find(params[:id])
    @task.destroy