app/controllers/task_lists_controller.rb

  def show
    @task_list = TaskList.find(params[:id])
---
SELECT * FROM `task_lists` WHERE (`task_lists`.`id` = 1)

  def edit
    @task_list = TaskList.find(params[:id])
---
SELECT * FROM `task_lists` WHERE (`task_lists`.`id` = 1)

  def create
    @task_list = TaskList.new(params[:task_list])
    @task_list.user_id = params[:user_id].to_i
    respond_to do |format|
      if @task_list.save
---
INSERT INTO `task_lists` (`created_at`, `title`, `updated_at`, `user_id`) VALUES('2010-09-12 08:42:35', 'first', '2010-09-12 08:42:35', 1)

  def update
    @task_list = TaskList.find(params[:id])

    respond_to do |format|
      if @task_list.update_attributes(params[:task_list])
---
SELECT * FROM `task_lists` WHERE (`task_lists`.`id` = 1)
UPDATE `task_lists` SET `updated_at` = '2010-09-12 08:42:47', `title` = 'first one' WHERE `id` = 1

  def load_user
    @user = User.find(params[:user_id].to_i)
---
SELECT * FROM `users` WHERE (`users`.`id` = 1)