app/controllers/task_lists_controller.rb

  def index
    @page_title = "Task Lists"
    @task_lists = TaskList.all
---
SELECT * FROM `task_lists` WHERE (`task_lists`.user_id = 1)