app/controllers/user_controller.rb

  def index
    if request.post?
      @user = User.new(params[:user])
      if @user.save
---
INSERT INTO `users` (`salt`, `created_at`, `updated_at`, `username`, `password`) VALUES('55306', '2010-09-11 14:14:15', '2010-09-11 14:14:15', 'arun', '005c8898ffbca4cb222b519b82bf0b2e')

  def login
    if request.post?
      @user = User.new(params[:user])

      user = User.find_by_username(@user.username)
---
SELECT * FROM `users` WHERE (`users`.`username` = 'test') LIMIT 1